//Первое задание:alert('Я JavaScript!')

// Второе задание {
// let name = "Иван"
// let admin = name
// alert(admin)
//}

//Третье задание{
//hello 1
//hello name
//hello Ilya
//}

//Четвертое задание{
//var name = prompt("Введите ваше имя:");
//alert("Ваше имя: " + name);
//}

//Пятое задание{
//c = 2
//d = 1
//}

//Шестое задание{
//a = 4 , x = 5
//}

//Седьмое задание{
//let a = parseInt(prompt("Первое число?", 1));
//let b = parseInt(prompt("Второе число?", 2));
//alert(a + b); // 3
//}

//Восьмое задание{
//1.True 2.false 3.True 4.True 5.False 6.false 7.false
//}

//Девятое задание{
//Да выведит alert
//}

//Десятое задание[
// let answer = prompt("Какое 'официальное' название JavaScript?");

// if (answer === "ECMAScript") {
//     alert("Верно!");
// } else {
//     alert("Не знаете? ECMAScript!");
// }
//]

//Одиннадцатое задание{
//}
// let number = parseInt(prompt("Введите число:"));

// if (number > 0) {
//   alert("1");
// } else if (number < 0) {
//   alert("-1");
// } else {
//   alert("0");
// }

//Двеннадцатое задание{
// let result = (a + b < 4) ? 'Мало' : 'Много';
// alert(result);  
//}

//Тринадцатое задание{
// let login = 'Директор';
// let message = (login == 'Сотрудник') ? 'Привет' :
// (login == 'Директор') ? 'Здравствуйте' :
// (login == '') ? 'Нет логина' : '';
// console.log(message); 
//}

//Четырнадцатое задание{
//Вывод:4
//}

//Пятнадцатое задание{
//Сначало 1,после 2
//}

//Шестнадцатое задание{
//Вывод:Ошибка
//}

//Семнадцатое задание{
//Вывод:1,после undefined
//}

//Восемнадцатое задание{
//Вывод:3
//}

//Девятнадцатое задание{
//Вывод:30
//}

//Двадцатое задание{
// let age = 90;

// if (age >= 14 && age <= 90) {
//     console.log("Возраст находится в диапазоне 14-90 включительно");
// } else {
//     console.log("Возраст не находится в диапазоне 14-90 включительно");
// }
    
//}

//21-ое задание{
// let age = 15;

// if (!(age >= 17 && age <= 99)) {
//     console.log("Возраст не находится в диапазоне 17-99 включительно");
// } else {
//     console.log("Возраст находится в диапазоне 17-99 включительно");
// }
    
//}

//22-ое задание{
//1.-1 является True,значит alert Выполнится,2.0 значение false,значит alert Не выполнится,3.Истина и Истина,значит alert Выполнится
//}

//23-ее задание{let login = prompt("Введите логин:");
// if (login === "Админ") {
// let password = prompt("Введите пароль:");
    
// if (password === "Я главный") {
// alert("Здравствуйте!");
// } else if (password === "" || password === null) {
// alert("Отменено");
// } else {
// alert("Неверный пароль");
// }} else if (login === "" || login === null) {
// alert("Отменено");} else {
// alert("Я вас не знаю");}
//}




